app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 9]]
---
<h3 style="color: #ddac0d; font-family: 'Ink Free'">Comments</h3>
<% @post.comments.each do |comment| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<% end %>
<p style="color: #f9f5f1; font-family: 'Ink Free'"><strong><%= @post.comments.count %> Comment(s)</strong></p>