app/controllers/admin_controller.rb

SELECT "requests".* FROM "requests"
---
  def admin
      @post = Post.new
      @requests = Request.all

SELECT "requests".* FROM "requests"
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "hi"], ["created_at", "2019-12-14 02:18:29.169396"], ["updated_at", "2019-12-14 02:18:29.169396"]]
---
  def create
      @requests = Request.all
      @post = Post.new(post_params)

      if @post.save

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 58], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 58]]
---
  def destroy
      @request = Request.find(params[:id])
      @request.destroy