app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "It's ok"], ["post_id", 2], ["created_at", "2019-12-15 18:53:09.255471"], ["updated_at", "2019-12-15 18:53:09.255471"]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Try studying in the library."], ["post_id", 1], ["created_at", "2019-12-15 18:46:14.882588"], ["updated_at", "2019-12-15 18:46:14.882588"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)

    if @comment.save