app/controllers/home_controller.rb

    def home
        @request = Request.new
        @posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

    def create
        @posts = Post.all
        @request = Request.new(request_params)

        if @request.save
---
SELECT "posts".* FROM "posts"
INSERT INTO "requests" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "hi"], ["created_at", "2019-12-15 22:24:53.014583"], ["updated_at", "2019-12-15 22:24:53.014583"]]